# MechanicalEquipmentSetIdParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MechanicalEquipmentSetIdParam Property
ParameterTypeId Class See Also
---
"Mechanical Equipment Set"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MechanicalEquipmentSetIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MechanicalEquipmentSetIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MechanicalEquipmentSetIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace